pub const QUESTION_HINT: &str = "Oh No!\n#User# 您触发了人机验证，请判断以下表达式的值是否为真（回答 true）或假（回答 false）：\n";
pub const QUESTION_MAP: [(&str, bool); 15] = [
    ("(9007199254740992u64 as f64 + 1.0f64) == (9007199254740992u64 as f64)", true),
    ("(9007199254740992u64 as f64 + 2.0f64) == (9007199254740994u64 as f64)", true),
    ("(9007199254740993u64 as f64) == (9007199254740992u64 as f64)", true),
    ("((16777216u32 as f32) + 1.0f32) == (16777216u32 as f32)", true),

    ("(0.1f64 * 3.0f64) == 0.3f64", false),
    ("(0.2f64 + 0.2f64 + 0.2f64) == 0.6f64", false),

    ("((1e16f64 + 1.0f64) - 1e16f64) == 1.0f64", false),
    ("(1e16f64 + (1.0f64 - 1e16f64)) == 1.0f64", true),

    ("(0.0f64 / 0.0f64) == (0.0f64 / 0.0f64)", false),
    ("(1.0f64 / 0.0f64) > 0.0f64", true),              
    ("(1.0f64 / -0.0f64) < 0.0f64", true),    
    ("(0.0f64 == -0.0f64)", true),

    ("(f64::MIN_POSITIVE / 2.0f64) > 0.0f64", true),
    ("(f64::MIN_POSITIVE / 2.0f64) == 0.0f64", false),

    ("(u64::MAX - 1u64) + 1u64 == u64::MAX", true),
];